import { Tabs, TabsContent, TabsList, TabsTrigger } from '@/components/ui/tabs'
import React from 'react'

export default function Page() {
	return (
		<>
			<Tabs defaultValue="account" className="w-full">
				<TabsList>
					<TabsTrigger value="account">Account</TabsTrigger>
					<TabsTrigger value="password">Password</TabsTrigger>
				</TabsList>
				<TabsContent value="account">
					У синьому небі зірки мерехтіли яскраво, наче драгоцінні камені на шатлі. Серед них виднілися два супернові
					вибухи, які розсипалися на мільйони малих фрагментів, подарованих простором. На березі великого океану
					розташована маленька рибацька хатка, де жив старий моряк зі своєю вірною собакою. Щоранку він виходив на
					пісчаний берег і розглядав хвилі, які розбивалися об берег із легкістю, яка приходила з десятилітньою
					практикою. У сусідньому селі великій сімї дідусь розповідав своїм онукам захоплюючі історії про далекі країни,
					які він відвідав у своєму молодому віці. Вони слухали його з захопленням, мріючи одного дня підкорити цей світ
					і відкрити для себе нові пригоди. Високо в горах на східному краю лісу росли дерева, столітні сосни, які
					створювали тінь від сонячних променів. Там, серед тиші і спокою, жили рідкісні види тварин і птахів, які вже
					стали легендами серед місцевих мешканців. Цей текст може бути використаний для будь-яких цілей, від творчого
					письма до вивчення мови чи перевірки роботи генератора тексту. Насолоджуйтеся його красою та різноманітністю!
				</TabsContent>
				<TabsContent value="password">Change your password here.</TabsContent>
			</Tabs>
		</>
	)
}
